import { Link } from "react-router-dom";
import styles from "./License.module.css";

const License = () => {
  return (
    <div className={styles.licensePageBackground}>
      <h1 className={styles.hLicense}>Ліцензійна угода</h1>
      <p className={styles.effectiveDate}>
        Набирає чинності з <strong>25 жовтня 2025 року</strong>
      </p>

      <div className={styles.licenseContent}>

        <section className={styles.section}>
          <h2>1. Загальні положення</h2>
          <p>
            Ця Ліцензійна угода (надалі — <strong>«Угода»</strong>) регулює
            відносини між <strong>ТОВ «SecretsHub»</strong> (надалі — <strong>«Оператор»</strong>),
            зареєстроване відповідно до законодавства України,
            та Вами (надалі — <strong>«Користувач»</strong>) щодо використання веб‑сервісу
            <strong> «SecretsHub»</strong> (надалі — <strong>«Сервіс»</strong>).
          </p>
          <p>
            Реєструючись або використовуючи Сервіс, Ви беззастережно приймаєте всі
            положення цієї Угоди.
          </p>
        </section>

        <section className={styles.section}>
          <h2>2. Визначення термінів</h2>
          <ul>
            <li><strong>Контент</strong> — будь‑який текст, інформація, що Користувач розміщує в Сервісі.</li>
            <li><strong>Акаунт</strong> — унікальний профіль Користувача.</li>
            <li><strong>Модерація</strong> — перевірка Контенту Оператором.</li>
          </ul>
        </section>

        <section className={styles.section}>
          <h2>3. Вік користувача</h2>
          <p>
            3.1 Використовувати Сервіс дозволено лише особам віком <strong>18 років і старше</strong>. Реєстрація особами молодшими 16 років заборонена.
          </p>
        </section>

        <section className={styles.section}>
          <h2>4. Права та обов’язки Користувача</h2>
          <p>4.1 Користувач має право розміщувати анонімний Контент у межах правил Сервісу.</p>
          <p>4.2 Забороняється розміщувати Контент, що містить: </p>
          <ul>
            <li>порушення чинного законодавства України;</li>
            <li>образи, погрози, дискримінацію та токсичний контент;</li>
            <li>спам або рекламні посилання;</li>
            <li>політичну агітацію;</li>
            <li>публікацію персональних даних інших осіб;</li>
            <li>порушення авторських прав або інтелектуальної власності третіх осіб.</li>
          </ul>
          <p className={styles.subr}>4.2.1 Якщо один з цих пунктів порушений Користувач має повне право зробити репорт на Контент</p>
          <p>4.3 Теми 18+ у вигляді тексту дозволені, але підлягають модерації.</p>
          <p>4.4 Контент має бути оформлений у вигляді завершеного тексту, 
            придатного для читання. Публікація недооформлених чернеток, 
            фрагментів думок, тексту з надмірними відступами або взагалі чогось, що не являє собою розповідь-пост(Секрет в нашому Сервісі) не відповідає меті Сервісу. Поважайте інших користувачів та їх час.
          </p>
          <p className={styles.subr}>4.4.1 За недотримання цих правил репорти на ваш пост повністю оправдані.</p>

        </section>

        <section className={styles.section}>
          <h2>5. Права та обов’язки Оператора</h2>
          <p>5.1 Оператор забезпечує доступ до Сервісу відповідно до умов цієї Угоди.</p>
          <p>5.2 Оператор має право <strong>вносити зміни в Сервіс</strong>, а також у правила цієї Угоди.</p>
          <p className={styles.subr}>5.2.1 Продовження використання Сервісу після змін означає прийняття нових умов.</p>
          <p>5.3 Оператор має право видаляти або блокувати Контент, що порушує цю Угоду.</p>
          <p>5.4 Оператор не несе відповідальності за Контент, розміщений Користувачами.</p>
        </section>

        <section className={styles.section}>
          <h2>6. Модерація</h2>
          <p>6.1 Оператор має право <strong>видаляти Контент або блокувати акаунти</strong> у разі порушення правил Сервісу.</p>
          <p>6.2 Модерація здійснюється у стандартному режимі: втручається при грубих порушеннях, спамі, або незаконному контенті.</p>
          <p>6.3 Користувач погоджується, що рішення модерації є остаточними та не підлягають обговоренню.</p>
          <p className={styles.subr}>6.3.1 У разі очевидної технічної помилки або помилкового блокування Користувач може звернутися до служби підтримки для перегляду рішення.</p>
          <h3>6.4 Модерація користувачами (репорти)</h3>
          <p>6.4.1 Користувачі мають право повідомляти про порушення правил Сервісу за допомогою системи репортів.</p>
          <p>6.4.2 Контент, який набере певну кількість репортів, може бути тимчасово прихований або відправлений на розгляд модераторів для остаточного рішення.</p>
          <p>6.4.3 Репорти повинні подаватися тільки у випадках <strong>дійсних порушень</strong> правил Сервісу, зокрема:</p>
          <ul>
            <li>образи, погрози, дискримінація;</li>
            <li>спам або реклама;</li>
            <li>політична агітація;</li>
            <li>публікація персональних даних інших осіб;</li>
            <li>порушення авторських прав;</li>
            <li>проблеми з формуванням посту.</li>
          </ul>
          <p>6.4.4 <strong>Зловживання системою репортів заборонено</strong>, зокрема:</p>
          <ul>
            <li>подача фальшивих репортів з особистих мотивів;</li>
            <li>намагання видалити Контент через конфлікт чи неприязнь;</li>
            <li>надмірне масове використання репортів без обґрунтування.</li>
          </ul>
          <p>6.4.5 Користувачі погоджуються, що <strong>остаточне рішення про видалення Контенту приймає модератор</strong> або автоматизована система відповідно до правил Сервісу.</p>
        </section>

        <section className={styles.section}>
          <h2>7. Відповідальність сторін</h2>
          <p>7.1 Користувач несе повну відповідальність за свій Контент.</p>
          <p>7.2 Сервіс надається «як є». Оператор <strong>не</strong> гарантує безперебійну роботу,
            відсутність помилок або збереження Контенту. Оператор не несе
            відповідальності за будь‑які збитки, що виникли внаслідок використання Сервісу.
          </p>
        </section>

        <section className={styles.section}>
          <h2>8. Зміни в Угоді</h2>
          <p>8.1 Оператор може оновлювати Угоду у будь-який час. Нова версія набуває чинності з моменту
            публікації на цій сторінці. Продовження використання Сервісу після змін
            вважається прийняттям нової редакції.</p>
        </section>

        <section className={styles.section}>
          <h2>9. Юрисдикція</h2>
          <p>9.1 Ця Угода регулюється законодавством України.</p>
          <p>9.2 У випадках, не врегульованих ним, застосовуються загальноприйняті міжнародні норми (UA+).</p>
        </section>

      </div>

    </div>
  )
}

export default License